Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: One important rule for unshared permission checks is that only one path match is applied, the most specific one. Naturally you can specify as many permissions with the same winning path as you want and they will all be applied. However, there can be permission checks you want to apply to many paths without repeating them over and over again. That's where shared permission checks come in, they are always applied when the permission path is matched.
ja_jp: 非共有権限チェックの重要なルールの 1 つは、最も具体的なパスマッチが 1 つだけ適用されることです。 当然、同じ優先パスを持つ権限を必要なだけ指定することができ、それらはすべて適用されます。 ただし、何度も繰り返さずに多くのパスに適用する権限チェックが必要になる場合があります。 そこで共有権限チェックを使用します。共有権限チェックは、権限パスがマッチしたときに常に適用されます。

source: One important rule for unshared permission checks is that only one path match is applied, the most specific one. When a path matches as the most specific, you can specify multiple permissions for that path and they are all applied. However, there can be permission checks you want to apply to many paths without repeating them over and over again. That's where shared permission checks come in, they are always applied when the permission path is matched.
ja_jp: 非共有権限チェックの重要なルールとして、最も具体的な 1 つのパスマッチのみが適用されます。パスが最も具体的なものとしてマッチする場合、そのパスに対して複数の権限を指定でき、それらはすべて適用されます。しかし、何度も繰り返さずに多くのパスに適用したい権限チェックがあるかもしれません。そこで共有権限チェックが役立ちます。共有権限チェックは、権限パスがマッチしたときに常に適用されます。

source: One important thing to understand is that, despite its name, RESTEasy Reactive supports both traditional blocking workloads and reactive workloads equally well. And in most cases, it is fully transparent and you don't even have to think about it: depending on your endpoints, RESTEasy Reactive will choose the paradigm that fits.
ja_jp: 理解すべき重要なことの1つは、その名前にもかかわらず、RESTEasy Reactiveは従来のブロック型ワークロードとリアクティブ型ワークロードの両方を等しくサポートしているということです。そして、ほとんどの場合、それは完全に透過的であり、考える必要さえありません。エンドポイントに応じて、RESTEasy Reactiveは適合するパラダイムを選択します。

source: One important thing you should be aware of is that leaking this password does not necessarily mean the actual secrets stored in the keystore will also be leaked since an unauthorized person will also need to access the actual keystore file. Restricting access to the keystore file to a limited number of roles and having Quarkus processes running in one of these roles will make it harder for anyone outside the group access the keystore. The keystore password can be set as an environment variable and this password should be periodically changed to limit a window during which an attacker can try to get to the keystore.
ja_jp: 注意すべき重要な点として、権限のないユーザーも実際のキーストアにアクセスする必要があるため、このパスワードが漏れたとしても、キーストアに保存されている実際のシークレットが漏れるとは限らないということがあります。 キーストアファイルへのアクセスを限られたロールに制限し、そのロールの1つでQuarkusプロセスを実行させることで、グループ外の人がキーストアにアクセスしにくくなります。 キーストアパスワードは環境変数として設定できます。攻撃者がキーストアにアクセスできる時間を制限するために、このパスワードを定期的に変更する必要があります。

source: One last step, now. We will use the https://chicory.dev/docs/usage/annotations#wasmmoduleinterface[`WasmModuleInterface` annotation] and configure the https://chicory.dev/docs/usage/annotations#enabling-the-annotation-processor[annotation processor], for Chicory to generate a Java class containing methods mapping 1:1 to Go exported functions.
ja_jp: 最後のステップです。 https://chicory.dev/docs/usage/annotations#wasmmoduleinterface[`WasmModuleInterface` アノテーション] を使用し、 https://chicory.dev/docs/usage/annotations#enabling-the-annotation-processor[アノテーションプロセッサー] を設定します。これにより、Chicory は Go のエクスポートされた関数と 1:1 でマッピングされるメソッドを含む Java クラスを生成します。

source: One last thing, it's a good practice to publish Homebrew formulae for non-snapshot releases thus change the project's version from `1.0.0-SNAPSHOT` to say `1.0.0.Alpha1` or go directly with `1.0.0` as you feel like doing. One last commit and we're done, say "feat: Add Homebrew packager configuration" as commit message. Alright, we're finally ready, let's post a release!
ja_jp: 最後に、スナップショットでないリリースの Homebrew 公式を公開するのは良い習慣なので、プロジェクトのバージョンを `1.0.0-SNAPSHOT` から `1.0.0.Alpha1` に変更するか、あるいはそのまま `1.0.0` に変更します。最後のコミットで完了です。feat: コミットメッセージは "feat: Add Homebrew packager configuration" です。さて、ついに準備が整いました。

source: One last thing: it's a good practice to publish Homebrew formulae for non-snapshot releases thus change the project's version from `1.0.0-SNAPSHOT` to say `1.0.0.Alpha1` or go directly with `1.0.0` as you feel like doing. One last commit, and we're done: say `feat: Add Homebrew packager configuration` as commit message. Alright, we're finally ready, let's post a release!
ja_jp: 最後に、スナップショットでないリリースの Homebrew 公式を公開するのは良い習慣なので、プロジェクトのバージョンを `1.0.0-SNAPSHOT` から `1.0.0.Alpha1` に変更するか、あるいはそのまま `1.0.0` に変更します。最後のコミットで完了です。コミットメッセージは "feat: Add Homebrew packager configuration" です。さて、ついに準備が整いました。リリースをポストしましょう。

source: One may also combine multiple native build options by separating with a comma, e.g.:
ja_jp: また、複数のネイティブ・ビルド・オプションをコンマで区切って組み合わせることもできます。例:

source: One of the 2 calls made with the value 2.
ja_jp: 値 2 で行われた 2 回の呼び出しのうちの 1 つ。

source: One of the Quarkus REST serialization extensions (`quarkus-rest-jackson`, `quarkus-rest-jsonb`, ...)
ja_jp: Quarkus RESTシリアライゼーションエクステンションの1つ ( `quarkus-rest-jackson` , `quarkus-rest-jsonb` , ...)

source: One of the REST JSON serialization extensions (such as `quarkus-rest-jackson`)
ja_jp: REST JSON シリアライゼーションエクステンションの 1 つ (例: `quarkus-rest-jackson`)

source: One of the RESTEasy JSON serialization extensions (`quarkus-rest-jackson` or `quarkus-rest-jsonb`)
ja_jp: RESTEasy JSONシリアライゼーションエクステンションの1つ ( `quarkus-rest-jackson` または `quarkus-rest-jsonb` )

source: One of the RESTEasy JSON serialization extensions (`quarkus-resteasy-reactive-jackson` or `quarkus-resteasy-reactive-jsonb`)
ja_jp: RESTEasy JSON シリアライゼーションエクステンションのどれか ( `quarkus-resteasy-jackson` または `quarkus-resteasy-jsonb` )

source: One of the RESTEasy JSON serialization extensions (the extension supports both Quarkus REST (formerly RESTEasy Reactive) and RESTEasy Classic)
ja_jp: RESTEasy JSONシリアライゼーションエクステンションの1つ（このエクステンションは、Quarkus REST（旧RESTEasy Reactive）とRESTEasy Classicの両方をサポートしています。）

source: One of the RESTEasy JSON serialization extensions (the extension supports both RESTEasy Classic and RESTEasy Reactive)
ja_jp: RESTEasy JSON シリアライゼーションエクステンションのどれか ( RESTEasy Classic と RESTEasy Reactive の両方をサポートしたエクステンション)

source: One of the RESTEasy Reactive serialization extensions (`quarkus-resteasy-reactive-jsonb`, `quarkus-resteasy-reactive-jackson`, ...)
ja_jp: RESTEasy JSON シリアライゼーションエクステンションのどれか ( `quarkus-resteasy-jackson` または `quarkus-resteasy-jsonb` )

source: One of the advantage of the Vert.x based server is the ability to use a single server to handle HTTP requests and gRPC requests. This is useful if you want to expose both REST and gRPC endpoints on the same port. This is not possible with the gRPC Java server (using a separate server).
ja_jp: Vert.x ベースのサーバーの利点の 1 つは、単一のサーバーを使用して HTTP リクエストと gRPC リクエストを処理できることです。これは、REST エンドポイントと gRPC エンドポイントの両方を同じポートで公開する場合に便利です。ただし、gRPC Java サーバーでは不可能です (別のサーバーを使用)。

source: One of the biggest changes in Quarkus 3 is that we upgraded Hibernate ORM from version 5 to version 6.2.
ja_jp: Quarkus 3の最大の変更点の1つは、Hibernate ORMをバージョン5からバージョン6.2へアップグレードしたことです。

source: One of the challenges brought by the distributed nature of microservices is that communication with external systems is inherently unreliable. This increases demand on resiliency of applications. To simplify making more resilient applications, Quarkus provides https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance] an implementation of the https://github.com/eclipse/microprofile-fault-tolerance/[MicroProfile Fault Tolerance] specification.
ja_jp: マイクロサービスの分散した性質がもたらす課題の1つは、外部システムとの通信が本質的に信頼できないことです。これにより、アプリケーションの耐障害性に対する要求が高まります。耐障害性の高いアプリケーションを簡単に作るために、Quarkusは link:https://github.com/eclipse/microprofile-fault-tolerance/[MicroProfile Fault Tolerance]仕様の実装である link:https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance]を提供します。

source: One of the challenges brought by the distributed nature of microservices is that communication with external systems is inherently unreliable. This increases demand on resiliency of applications. To simplify making more resilient applications, Quarkus provides https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance], an implementation of the https://github.com/eclipse/microprofile-fault-tolerance/[MicroProfile Fault Tolerance] specification.
ja_jp: マイクロサービスの分散した性質がもたらす課題の1つは、外部システムとの通信が本質的に信頼できないことです。これにより、アプリケーションの耐障害性に対する要求が高まります。より耐障害性の高いアプリケーションを簡単に作るために、Quarkusは link:https://github.com/eclipse/microprofile-fault-tolerance/[MicroProfile Fault Tolerance]仕様の実装である link:https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance]を提供します。

source: One of the core features of Vert.x is the https://vertx.io/docs/vertx-core/java/#event_bus[event bus]. It provides a message-based backbone to your application. So, you can have components interacting using asynchronous message passing, and so decouple your components. You can send a message to a single consumer, or dispatch to multiple consumers, or implement a request-reply interaction, where you send a message (request) and expect a response. This is what we are going to use in this section. Our `VertxResource` will send a message containing a name to the `greetings` address. Another component will receive the message and produce the "hello $name" response. The `VertxResource` will receive the response and return it as the HTTP response.
ja_jp: Vert.xのコア機能の1つに link:https://vertx.io/docs/vertx-core/java/#event_bus[イベントバス] があります。 これは、アプリケーションにメッセージベースのバックボーンを提供します。 そのため、非同期メッセージパッシングを使用して相互作用するコンポーネントを持つことができ、コンポーネントを分離することができます。単一のコンシューマーにメッセージを送信することも、複数のコンシューマーにディスパッチすることも、メッセージ（リクエスト）を送信してレスポンスを期待するリクエスト・リプライ型のインタラクションを実装することもできます。 このセクションではこれを使用します。 `VertxResource` は、名前を含むメッセージを `greetings` のアドレスに送信します。 別のコンポーネントがそのメッセージを受け取り、"hello $name "というレスポンスを返します。 `VertxResource` はレスポンスを受け取り、HTTP レスポンスとして返します。

source: One of the drawbacks of using native executables is that they cannot be debugged using the standard Java debuggers, instead we need to debug them using `gdb`, the GNU Project debugger. To demonstrate how to do this, we are going to generate a native Quarkus application that crashes due to a Segmentation Fault when accessing http://localhost:8080/crash. To achieve this, add the following REST resource to the project:
ja_jp: ネイティブ実行可能ファイルを使用することの欠点の 1 つは、標準の Java デバッガーを使用してデバッグできないことです。代わりに、GNU プロジェクトのデバッガーである `gdb` を使用してデバッグする必要があります。その方法を示すために、 http://localhost:8080/crash にアクセスするときにセグメンテーション違反が原因でクラッシュするネイティブ Quarkus アプリケーションを生成します。これを実現するには、以下の REST リソースをプロジェクトに追加します。

source: One of the founding principles of Quarkus is to bring joy to Java developers by creating a frictionless experience through a combination of tools, libraries, extensions, and more. This release continues that mission by making developers more efficient with new tools and services such as Dev UI, Quarkus CLI, and PACT contract testing.
ja_jp: Quarkusの設立理念の1つは、ツール、ライブラリ、エクステンションなどの組み合わせによって摩擦のない体験を提供し、Java開発者に満足をもたらすことです。このリリースでは、Dev UI、Quarkus CLI、PACT契約テストなどの新しいツールやサービスによって開発者の効率を高めることで、この使命を継続しています。

source: One of the goals of this refactor is to have all these different run modes boot Quarkus in fundamentally the same way.
ja_jp: このリファクタの目的の一つは、これらの異なる実行モードのすべてが基本的に同じ方法で Quarkus を起動できるようにすることです。

source: One of the key differences between HotSpot’s Serial GC and GraalVM’s Serial GC is the way they perform full GC cycles. In HotSpot the algorithm used is mark-sweep-compact whereas in GraalVM it is mark-copy. Both need to traverse all live objects, but in mark-copy this traversal is also used to copy live objects to a secondary space or semi-space. As objects are copied from one semi-space to another they’re also compacted. In mark-sweep-compact, the compacting requires a second pass on the live objects. This makes full GCs in mark-copy more time efficient (in terms of time spent in each GC cycle) than mark-sweep-compact. The tradeoff mark-copy makes in order to make individual full GC cycles shorter is space. The use of semi-spaces means that for an application to maintain the same GC performance that mark-sweep achieves (in terms of allocated MB per second), it requires double the amount of memory.
ja_jp: HotSpotのシリアルGCとGraalVMのシリアルGCの主な違いの1つは、完全なGCサイクルを実行する方法です。HotSpotで使用されるアルゴリズムはmark-sweep-compactであるのに対し、GraalVMではmark-copyです。どちらもすべてのライブオブジェクトをトラバースする必要がありますが、マークコピーでは、このトラバーサルは、セカンダリ空間または半空間にライブオブジェクトをコピーするためにも使用されます。オブジェクトが半空間から別の半空間へコピーされる際に、オブジェクトもコンパクトになります。mark-sweep-compactでは、コンパクト化にはライブ・オブジェクトに対する2回目のパスが必要です。このため、mark-copyのフルGCは、mark-sweep-compactよりも時間効率（各GCサイクルに費やされる時間という意味で）が高くなっています。個々のフルGCサイクルを短くするために、mark-copyが行うトレードオフはスペースです。semi-spaces の使用は、アプリケーションがmark-sweepが達成するのと同じGCパフォーマンス（1秒あたりの割り当てMB数）を維持するために、2倍のメモリ量を必要とすることを意味します。

source: One of the main complaints we got about Reactive Routes was about the development model: it’s very different from the one used with RESTEasy. However, Reactive Routes allowed us to verify the performance and efficiency benefits of using an end-to-end reactive model on top of Quarkus. RESTEasy Reactive can be seen as the “next generation”: you get the runtime benefits while also using a familiar development model.
ja_jp: Reactive Routes についての主な不満の 1 つは、開発モデルに関するものでした。RESTEasy で使用したものとは大きく異なります。しかし、Reactive Routes を使用することで、Quarkus 上にエンドツーエンドのリアクティブモデルを使用することで得られるパフォーマンスと効率性のメリットを検証することができました。RESTEasy Reactive は「次世代」と考えることができます。

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
ja_jp: Quarkusの主な目標の1つは、拡張性の容易さと活気のあるエコシステムの構築です。

source: One of the main ideas of REST (https://tools.ietf.org/html/rfc7231#section-3.4[and HTTP]) is that your resource is independent from its representation, and that both the client and server are free to represent their resources in as many media types as they want. This allows the server to declare support for multiple representations and let the client declare which ones it supports and get served something appropriate.
ja_jp: REST (https://tools.ietf.org/html/rfc7231#section-3.4[および HTTP]) の主な考え方の 1 つは、リソースはその表現から独立しており、クライアントとサーバーの両方が、望むだけ多くのメディアタイプでリソースを自由に表現できることです。これにより、サーバーは複数の表現のサポートを宣言し、クライアントはどの表現をサポートするかを宣言し、適切なものを提供されるようにすることができます。

source: One of the main ideas of REST (https://tools.ietf.org/html/rfc7231#section-3.4[and HTTP]) is that your resource is independent of its representation, and that both the client and server are free to represent their resources in as many media types as they want. This allows the server to declare support for multiple representations and let the client declare which ones it supports and get served something appropriate.
ja_jp: REST (https://tools.ietf.org/html/rfc7231#section-3.4[および HTTP]) の主な考え方の 1 つは、リソースはその表現に依存せず、クライアントとサーバーの両方が、望むだけ多くのメディアタイプでリソースを自由に表現できることです。これにより、サーバーは複数の表現のサポートを宣言し、クライアントはどの表現をサポートするかを宣言し、適切なものを提供されるようにすることができます。

source: One of the main outputs of the build process is recorded bytecode. This bytecode actually sets up the runtime environment. For example, in order to start Undertow, the resulting application will have some bytecode that directly registers all Servlet instances and then starts Undertow.
ja_jp: ビルドプロセスの主要なアウトプットの1つは、記録されたバイトコードです。このバイトコードは、実際に実行時環境を設定します。例えば、Undertowを起動するために、出来上がったアプリケーションには、すべてのServletインスタンスを直接登録し、その後Undertowを起動するバイトコードが含まれます。

source: One of the main things an extension is likely to do is completely separate the configuration phase of behavior from the runtime phase. Frameworks often do parsing/load of configuration on startup that can be done during build time to both reduce the runtime dependencies on frameworks like xml parsers as well as reducing the startup time the parsing incurs.
ja_jp: エクステンションの主な目的の1つは、動作の設定段階を実行段階から完全に分離することです。フレームワークは起動時に設定の解析や読み込みを行うことが多いですが、これをビルド時に行うことで、xmlパーサーなどのフレームワークへの実行時の依存を減らし、解析にかかる起動時間を短縮することができます。

source: One of the major new enhancements added in the 1.10.0 release was the introduction of language support for the Quarkus-specific https://quarkus.io/guides/qute[Qute templating engine]. These new features allow Quarkus developers to visualize the changes they make to their Quarkus Java projects, where all files and sub-directories located in `src/main/resources/templates` are watched for changes and modifications and made immediately visible.
ja_jp: 1.10.0リリースで追加された主な新機能の1つは、Quarkus固有の link:https://quarkus.io/guides/qute[テンプレートエンジンであるQute] の言語サポートの導入です。これらの新機能により、Quarkusの開発者は、Quarkus Javaプロジェクトに加えた変更を可視化できます。 `src/main/resources/templates` にあるすべてのファイルとサブディレクトリの変更と修正が監視され、すぐに可視化されるようになりました。

source: One of the nice things about this work is that it's allowed us to explore various performance-related questions, beyond just "does Quarkus have awesome performance?" For example, would running with virtual threads affect the results? Yes! Virtual threads added about 6k transactions per second, for all frameworks.
ja_jp: この作業の素晴らしい点の一つは、「Quarkusには素晴らしいパフォーマンスがあるのか？」という問いを超えて、パフォーマンスに関する様々な疑問を探求できるようになったことです。例えば、仮想スレッドで実行すると結果に影響があるでしょうか？はい！すべてのフレームワークで、仮想スレッドは約6,000トランザクション/秒を追加しました。

source: One of the possible explanations could be a lack of entropy, e.g. on an entropy constrained VM, if such a source is needed as it is the case with Bouncycastle at build time.
ja_jp: 考えられる説明の 1 つは、エントロピーの欠如です。 例えば、エントロピーに制約のある VM で、Bouncycastle のビルド時のようにそのようなソースが必要な場合。

source: One of these annotations is the `@BsonDiscriminator` annotation that allows to storage multiple Java types in a single MongoDB collection by adding a discriminator field inside the document. It can be useful when working with abstract types or interfaces.
ja_jp: このアノテーションのひとつに `@BsonDiscriminator` アノテーションがありますが、これは、ドキュメントの中にデリミタフィールドを追加することで、複数の Java 型をひとつの MongoDB コレクションに保存できるようにするものです。抽象的な型やインターフェイスを扱うときに便利です。

source: One option to ensure the information for resolving the tenant configurations for `web-app` applications is available before and after the redirect is to use a cookie, for example:
ja_jp: リダイレクトの前後に `web-app` アプリケーションのテナント設定を解決するための情報を確実に利用できるようにするための 1 つのオプションは、Cookie を使用することです。以下はその例です。

source: One or more _brokers_, which are stateless components.
ja_jp: ステートレスコンポーネントである 1 つ以上のブローカー。

source: One or more interceptor bindings; `@Transactional` is just an example.
ja_jp: 1 つ以上のインターセプターバインディング。 `@Transactional` は単なる例です。

source: One or more named proxies that extensions can reference
ja_jp: エクステンションが参照できる 1 つ以上の名前付きプロキシー

source: One possible way to make Quarkus use these entries to connect the database is to use the following configuration:
ja_jp: Quarkusがこれらのエントリーを使用してデータベースに接続する方法としては、以下のような設定が考えられます。

source: One solution for this case is to configure the following:
ja_jp: この場合の解決策の 1 つとして、次のように設定してください。

source: One special category is https://github.com/quarkusio/quarkus/discussions/categories/quarkus-blog-website[Quarkus Blog/Website] that is used for comments made on the blog.
ja_jp: 特別なカテゴリーとして、ブログに寄せられたコメントに使用される link:https://github.com/quarkusio/quarkus/discussions/categories/quarkus-blog-website[Quarkus Blog/Website]があります。

source: One thing to note about the create command for native is that the `aws lambda create-function` call must set a specific environment variable:
ja_jp: ネイティブ用のcreateコマンドについて注意すべき点は、 `aws lambda create-function` 呼び出しで特定の環境変数を設定しなければならないということです。

source: One thing to note is that the live reload feature is not available when making changes to both Java and Kotlin source that have dependencies on each other. We hope to alleviate this limitation in the future.
ja_jp: 注意点としては、お互いに依存関係にあるJavaとKotlinの両方のソースに変更を加えた場合、ライブリロード機能が利用できないということです。将来的にはこの制限を緩和したいと考えています。

source: One thing we were concerned about though, was memory consumption, CPU usage and startup times since for a given application, each tenant is deployed in isolation in its own deployment process. For that reason we decided to not depend on any application framework when we started the Java rewrite, because if they do offer productivity and standardization, the abstraction they provide comes with a resource cost. So the program was written in plain Java, and it was small enough in size and use cases that we were able get away with it, provided we relied on a few patterns (e.g. constructor based injection by hand) for clean code. This program is called _ocpdeploy_.
ja_jp: しかし、一つ気になったのは、メモリ消費量、CPU使用率、起動時間でした。というのも、あるアプリケーションでは、各テナントがそれぞれのデプロイメントプロセスで独立してデプロイされるからです。というのも、アプリケーションフレームワークは生産性や標準化の面では優れていますが、抽象化の面ではリソースコストがかかるからです。そのため、プログラムはプレーンなJavaで書かれており、サイズもユースケースも十分に小さかったので、クリーンなコードのためにいくつかのパターン（例：コンストラクタベースのインジェクションを手作業で行う）に頼ることを条件に、それで済ませることができました。このプログラムは _ocpdeploy_ といいます。

source: One way to achieve it is to <<listen-to-authentication-events, listen to OIDC events such as a user login>>. However, when an event listener must perform an asynchronous action, this action will be completed some time after the request that sent the event has been allowed to proceed.
ja_jp: これを達成する一つの方法は、<<listen-to-authentication-events,ユーザーログインなどの OIDC イベントをリッスンする>> ことです。 ただし、イベントリスナーが非同期アクションを実行する必要がある場合、このアクションは、イベントを送信したリクエストが処理を許可された後、しばらくしてから完了します。

source: One way to deploy an application to OpenShift is to use s2i (source to image) to create an image stream from the source and then deploy the image stream:
ja_jp: アプリケーションを OpenShift にデプロイする方法の1つとして、s2i(source to image)を使用してソースからイメージストリームを作成し、イメージストリームをデプロイする方法があります。

source: One way to fix it is to build singletons using CDI's `@Singleton` annotation:
ja_jp: これを修正する 1 つの方法は、CDI の `@Singleton` アノテーションを使用してシングルトンを構築することです。

source: One where all operations are present. By default, served under `/q/openapi`
ja_jp: すべての操作が含まれるもの。デフォルトでは `/q/openapi` で提供されます。

source: One where only the order operations are present. By default, served under `/q/openapi-order`
ja_jp: 注文操作のみが含まれるもの。デフォルトでは `/q/openapi-order` で提供されます。

source: One where only the user operations are present. By default, served under `/q/openapi-user`
ja_jp: ユーザー操作のみが含まれるもの。デフォルトでは `/q/openapi-user` で提供されます。

source: Only *method-level bindings* are considered for backward compatibility reasons (otherwise static methods of bean classes that declare class-level bindings would be suddenly intercepted)
ja_jp: 下位互換性の理由から *メソッドレベルのバインディング* のみが考慮されます (そうでないとクラスレベルのバインディングを宣言している Bean クラスのStaticメソッドが突然傍受されてしまいます)。

source: Only OIDC tenants with the application type `service` or `hybrid` are considered. These tenants must have a token issuer discovered or configured.
ja_jp: アプリケーションタイプが `service` または `hybrid` である OIDC テナントのみが考慮されます。これらのテナントでは、トークン issuer が検出または設定されている必要があります。

source: Only `Multi<String>`, `Multi<Object>` and `Multi<Void>` can be written into the JSON Array. Using a `Multi<Void>` produces an empty array. You cannot use `Multi<Buffer>`. If you need to use `Buffer`, transform the content into a JSON or String representation first.
ja_jp: `Multi<String>`、 `Multi<Object>`、 `Multi<Void>` のみ JSON 配列に書き込むことができます。 `Multi<Void>` を使用すると空の配列が生成されます。 `Multi<Buffer>` は使用できません。 `Buffer` を使用する必要がある場合は、最初にコンテンツを JSON または文字列表現に変換します。

source: Only a single JAX-RS application
ja_jp: 単一のJAX-RSアプリケーションのみ

source: Only a single Jakarta REST application
ja_jp: 単一のJakarta RESTアプリケーション限定

source: Only a single profile may be active at a time.
ja_jp: 一度にアクティブにできるプロファイルは 1 つだけです。

source: Only a single provider of any given capability is allowed in an application. If more than one provider of a capability is detected, the application build will fail with the corresponding error message.
ja_jp: 1つのアプリケーションで許可されるのは、任意のケイパビリティの単一のプロバイダーのみです。1つのケイパビリティに対して複数のプロバイダーが検出された場合、アプリケーションのビルドは対応するエラーメッセージを表示して失敗します。
